{
    "Install and run Visual Studio Code. In your Terminal (or Command Prompt), type code -s and press Enter. Copy and paste the entire output below. What is the output of code -s?":"ga1_q1",
    "Running uv run --with httpie -- https [URL] installs the Python package httpie and sends a HTTPS request to the URL.Send a HTTPS request to https://httpbin.org/get with the URL encoded parameter email set to 23ds3000185@ds.study.iitm.ac.in What is the JSON output of the command? (Paste only the JSON body, not the headers)":"ga1_q2",
    "Download . In the directory where you downloaded it, make sure it is called README.md, and run npx -y prettier@3.4.2 README.md | sha256sum. What is the output of the command?":"ga1_q3",
    "Let's make sure you can write formulas in Google Sheets. Type this formula into Google Sheets. (It won't work in Excel) =SUM(ARRAY_CONSTRAIN(SEQUENCE(100, 100, 12, 11), 1, 10)) What is the result?":"ga1_q4",
    "Let's make sure you can write formulas in Excel. Type this formula into Excel. Note: This will ONLY work in Office 365.=SUM(TAKE(SORTBY({9,1,3,15,9,6,1,7,0,7,8,13,13,10,4,9}, {10,9,13,2,11,8,16,14,7,15,5,4,6,1,3,12}), 1, 5)) What is the result?":"ga1_q5",
    "How many Wednesdays are there in the date range 1987-03-27 to 2014-12-24? The dates are in the year-month-day format. Include both the start and end date in your count. You can do this using any tool (e.g. Excel, Python, JavaScript, manually).":"ga1_q7",
    "Download and unzip file q-extract-csv-zip.zip  which has a single extract.csv file inside. What is the value in the answer column of the CSV file?":"ga1_q8",
    "Let's make sure you know how to use JSON. Sort this JSON array of objects by the value of the age field. In case of a tie, sort by the name field. Paste the resulting JSON below without any spaces or newlines. Sorted JSON:":"ga1_q9",
    "Download and process the files in  which contains three files with different encodings: data1.csv: CSV file encoded in CP-1252 data2.csv: CSV file encoded in UTF-8 data3.txt: Tab-separated file encoded in UTF-16 Each file has 2 columns: symbol and value. Sum up all the values where the symbol matches ‰ OR œ OR  across all three files. What is the sum of all values associated with these symbols?":"ga1_q12",
    "Create a new public repository. Commit a single JSON file called email.json with the value email:23ds3000185@ds.study.iitm.ac.in and push it. Enter the raw Github URL of email.json so we can verify it. (It might look like https://raw.githubusercontent.com/[GITHUB ID]/[REPO NAME]/main/email.json.)":"ga1_q13",
    "Download q-replace-across-files.zip and unzip it into a new folder, then replace all IITM with IIT Madras in all files.":"ga1_q14",
    "Download  and extract it. Use mv to move all files under folders into an empty folder. Then rename all files replacing each digit with the next. 1 becomes 2, 9 becomes 0, a1b9c.txt becomes a2b0c.txt.What does running grep . * | LC_ALL=C sort | sha256sum in bash on that folder show?":"ga1_q16",
    "Download  and extract it. Use ls with options to list all files in the folder along with their date and file size. What's the total size of all files at least 4510 bytes large and modified on or after Tue, 31 Dec, 2019, 11:13 am IST?":"ga1_q15",
    "Download q-compare-files.zip and extract it. It has 2 nearly identical files, a.txt and b.txt, with the same number of lines.How many lines are different between a.txt and b.txt?":"ga1_q17",
    "What is the total sales of all the items in the Gold ticket type? Write SQL to calculate it.":"ga1_q18",
    "What is the total number of ducks across players on page number 1 of ESPN Cricinfo's ODI batting stats ":"ga4_q1",
    "Source: Utilize IMDb's advanced web search at https://www.imdb.com/search/title/ to access movie data.Filter: Filter all titles with a rating between 3 and 4.Format: For up to the first 25 titles, extract the necessary details: ID, title, year, and rating. The ID of the movie is the part of the URL after tt in the href attribute. For example, tt10078772. Organize the data into a JSON structure as follows:":"ga4_q2",
    "Write a web application that exposes an API with a single query parameter: ?country=. It should fetch the Wikipedia page of the country, extracts all headings (H1 to H6), and create a Markdown outline for the country. The outline should look like this: API Development: Choose any web framework (e.g., FastAPI) to develop the web application. Create an API endpoint (e.g., /api/outline) that accepts a country query parameter. Fetching Wikipedia Content: Find out the Wikipedia URL of the country and fetch the page's HTML. Extracting Headings: Use an HTML parsing library (e.g., BeautifulSoup, lxml) to parse the fetched Wikipedia page. Extract all headings (H1 to H6) from the page, maintaining order. Generating Markdown Outline: Convert the extracted headings into a Markdown-formatted outline. Headings should begin with #. Enabling CORS: Configure the web application to include appropriate CORS headers, allowing GET requests from any origin. What is the URL of your API endpoint?":"ga4_q3",
    "you are tasked with developing a system that automates the following: API Integration and Data Retrieval: Use the BBC Weather API to fetch the weather forecast for Los Angeles. Send a GET request to the locator service to obtain the city's locationId. Include necessary query parameters such as API key, locale, filters, and search term (city). Weather Data Extraction: Retrieve the weather forecast data using the obtained locationId. Send a GET request to the weather broker API endpoint with the locationId. Data Transformation: Extract the localDate and enhancedWeatherDescription from each day's forecast. Iterate through the forecasts array in the API response and map each localDate to its corresponding enhancedWeatherDescription. Create a JSON object where each key is the localDate and the value is the enhancedWeatherDescription. The output would look like this. What is the JSON weather forecast description for Los Angeles?":"ga4_q4",
    "What is the minimum latitude of the bounding box of the city Dhaka in the country Bangladesh on the Nominatim API? Value of the minimum latitude":"ga4_q5",
    "What is the link to the latest Hacker News post mentioning 2FA having at least 63 points?":"ga4_q6",
    "Using the GitHub API, find all users located in the city Chicago with over 140 followers.Enter the date (ISO 8601, e.g. 2024-01-01T00:00:00Z) when the newest user joined GitHub.":"ga4_q7",
    "Include a step with your email 23ds3000185@ds.study.iitm.ac.in in its name. Enter your repository URL (format: https://github.com/USER/REPO):":"ga4_q8",
    "This file,  contains a table of student marks in Maths, Physics, English, Economics, and Biology.What is the total Biology marks of students who scored 49 or more marks in Maths in groups 1-23 (including both groups)?":"ga4_q9",
    "What is the markdown content of the PDF, formatted with prettier@3.4.2?":"ga4_q10"
}